In [92]:
import pandas as pd

In [93]:
import numpy as np

In [94]:
series = pd.Series(data=[1,2,3], index=['i','ii','iii'])

In [95]:
print(series)

i      1
ii     2
iii    3
dtype: int64

In [96]:
print(type(series))

<class 'pandas.core.series.Series'>

In [97]:
print(f"Accessing first element using series[0]: {series[0]}")
print(f"Accessing first element using series['i']: {series['i']}")

Accessing first element using series[0]: 1
Accessing first element using series['i']: 1

/var/folders/r3/pdzzngtx1nzc5n6m5_5nm9540000gn/T/ipykernel_58650/3570441050.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  print(f"Accessing first element using series[0]: {series[0]}")

In [98]:
series = pd.Series(data={'i':1, 'ii':2, 'iii':3})

In [99]:
print(series)

i      1
ii     2
iii    3
dtype: int64

In [100]:
print(type(series))

<class 'pandas.core.series.Series'>

In [101]:
series = pd.Series(data=np.array([1,2,3]), index=['i','ii','iii'])

In [102]:
print(series)

i      1
ii     2
iii    3
dtype: int64

In [103]:
print(type(series))

<class 'pandas.core.series.Series'>

In [104]:
series = pd.Series(pd.Series(data=[100,200,300]))

In [105]:
print(series)

0    100
1    200
2    300
dtype: int64

In [106]:
print(type(series))

<class 'pandas.core.series.Series'>

In [107]:
biweekly1 = pd.Series(data=[2500, 5000, 3200], index=['Ross', 'Dan', 'Carlos'])

In [108]:
print(biweekly1)

Ross      2500
Dan       5000
Carlos    3200
dtype: int64

In [109]:
biweekly2 = pd.Series(data=[2500, 5000, 3200], index=['Ross','Dan','Carlos'])

In [110]:
monthly_payroll = biweekly1 + biweekly2

In [111]:
print(monthly_payroll)

Ross       5000
Dan       10000
Carlos     6400
dtype: int64

In [112]:
myDF = pd.DataFrame(data = np.arange(0,25).reshape(5,5), index=['A','B','C','D','E'], columns=['1','2','3','4','5'])

In [113]:
print(myDF)

    1   2   3   4   5
A   0   1   2   3   4
B   5   6   7   8   9
C  10  11  12  13  14
D  15  16  17  18  19
E  20  21  22  23  24

In [114]:
print(type(myDF))

<class 'pandas.core.frame.DataFrame'>

In [115]:
print(myDF['5'])

A     4
B     9
C    14
D    19
E    24
Name: 5, dtype: int64

In [116]:
myDF = pd.DataFrame(data = np.arange(0,25).reshape(5,5), columns=['1','2','3','4','5'])

In [117]:
print(myDF)

    1   2   3   4   5
0   0   1   2   3   4
1   5   6   7   8   9
2  10  11  12  13  14
3  15  16  17  18  19
4  20  21  22  23  24

In [118]:
print(type(myDF))

<class 'pandas.core.frame.DataFrame'>

In [119]:
myDF = pd.DataFrame(data = np.arange(0,25).reshape(5,5), index = ['A','B','C','D','E'], columns=['1','2','3','4','5'])

In [120]:
print(myDF)

    1   2   3   4   5
A   0   1   2   3   4
B   5   6   7   8   9
C  10  11  12  13  14
D  15  16  17  18  19
E  20  21  22  23  24

In [121]:
print(type(myDF))

<class 'pandas.core.frame.DataFrame'>

In [122]:
print(myDF['2'])

A     1
B     6
C    11
D    16
E    21
Name: 2, dtype: int64

In [123]:
myDF[['2','5']]

    2   5
A   1   4
B   6   9
C  11  14
D  16  19
E  21  24

In [124]:
myDF.iloc[1]

1    5
2    6
3    7
4    8
5    9
Name: B, dtype: int64

In [125]:
myDF.iloc[0:5]

    1   2   3   4   5
A   0   1   2   3   4
B   5   6   7   8   9
C  10  11  12  13  14
D  15  16  17  18  19
E  20  21  22  23  24

In [126]:
myDF.loc['A':'E']

    1   2   3   4   5
A   0   1   2   3   4
B   5   6   7   8   9
C  10  11  12  13  14
D  15  16  17  18  19
E  20  21  22  23  24

In [127]:
myDF.loc['B']

1    5
2    6
3    7
4    8
5    9
Name: B, dtype: int64

In [128]:
myDF.iloc[0:5, 0:3]

    1   2   3
A   0   1   2
B   5   6   7
C  10  11  12
D  15  16  17
E  20  21  22

In [129]:
myDF.loc['A':'E', '1':'3']

    1   2   3
A   0   1   2
B   5   6   7
C  10  11  12
D  15  16  17
E  20  21  22

In [130]:
myDF = pd.DataFrame(data=np.arange(0,25).reshape(5,5), index=['A','B','C','D','E'], columns=['1','2','3','4','5'])

In [131]:
myDF % 2 == 0

       1      2      3      4      5
A   True  False   True  False   True
B  False   True  False   True  False
C   True  False   True  False   True
D  False   True  False   True  False
E   True  False   True  False   True

In [132]:
myDF[myDF % 2 == 0]

      1     2     3     4     5
A   0.0   NaN   2.0   NaN   4.0
B   NaN   6.0   NaN   8.0   NaN
C  10.0   NaN  12.0   NaN  14.0
D   NaN  16.0   NaN  18.0   NaN
E  20.0   NaN  22.0   NaN  24.0

In [133]:
myDF[myDF % 2 != 0]

      1     2     3     4     5
A   NaN   1.0   NaN   3.0   NaN
B   5.0   NaN   7.0   NaN   9.0
C   NaN  11.0   NaN  13.0   NaN
D  15.0   NaN  17.0   NaN  19.0
E   NaN  21.0   NaN  23.0   NaN

In [134]:
myDF[myDF % 2 == 0].fillna(value=0.0)

      1     2     3     4     5
A   0.0   0.0   2.0   0.0   4.0
B   0.0   6.0   0.0   8.0   0.0
C  10.0   0.0  12.0   0.0  14.0
D   0.0  16.0   0.0  18.0   0.0
E  20.0   0.0  22.0   0.0  24.0

In [135]:
myDF[myDF % 2 == 0].fillna(value=myDF['3'].mean())

      1     2     3     4     5
A   0.0  12.0   2.0  12.0   4.0
B  12.0   6.0  12.0   8.0  12.0
C  10.0  12.0  12.0  12.0  14.0
D  12.0  16.0  12.0  18.0  12.0
E  20.0  12.0  22.0  12.0  24.0

In [136]:
print(myDF)

    1   2   3   4   5
A   0   1   2   3   4
B   5   6   7   8   9
C  10  11  12  13  14
D  15  16  17  18  19
E  20  21  22  23  24

In [137]:
myDF['newCol6']=[10,20,30,40,50]

In [138]:
myDF

    1   2   3   4   5  newCol6
A   0   1   2   3   4       10
B   5   6   7   8   9       20
C  10  11  12  13  14       30
D  15  16  17  18  19       40
E  20  21  22  23  24       50

In [139]:
myDF['col2'+'+ col4'] = myDF['2'] + myDF['4']

In [140]:
myDF

    1   2   3   4   5  newCol6  col2+ col4
A   0   1   2   3   4       10           4
B   5   6   7   8   9       20          14
C  10  11  12  13  14       30          24
D  15  16  17  18  19       40          34
E  20  21  22  23  24       50          44

In [141]:
myDF.drop(columns=['newCol6'])

    1   2   3   4   5  col2+ col4
A   0   1   2   3   4           4
B   5   6   7   8   9          14
C  10  11  12  13  14          24
D  15  16  17  18  19          34
E  20  21  22  23  24          44

In [142]:
myDF

    1   2   3   4   5  newCol6  col2+ col4
A   0   1   2   3   4       10           4
B   5   6   7   8   9       20          14
C  10  11  12  13  14       30          24
D  15  16  17  18  19       40          34
E  20  21  22  23  24       50          44

In [144]:
myDF.drop(columns=['newCol6'], inplace=True)

In [145]:
myDF

    1   2   3   4   5  col2+ col4
A   0   1   2   3   4           4
B   5   6   7   8   9          14
C  10  11  12  13  14          24
D  15  16  17  18  19          34
E  20  21  22  23  24          44

In [150]:
#DataFrames: Groupby and Common Operations

In [151]:
myDF = pd.DataFrame({'Type': ['Falcon', 'Falcon', 'Parrot', 'Parrot', 'Cat', 'Cat', 'Cat'],
                      'Max Speed': [380., 370., 24., 26., 50., 50., 150.]})
myDF

     Type  Max Speed
0  Falcon      380.0
1  Falcon      370.0
2  Parrot       24.0
3  Parrot       26.0
4     Cat       50.0
5     Cat       50.0
6     Cat      150.0

In [152]:
print(f"unique types: {myDF['Type'].unique()}")

unique types: ['Falcon' 'Parrot' 'Cat']

In [153]:
print(f"unique max speeds: {myDF['Max Speed'].unique()}")

unique max speeds: [380. 370.  24.  26.  50. 150.]

In [154]:
myDF['Type'].value_counts()

Type
Cat       3
Falcon    2
Parrot    2
Name: count, dtype: int64

In [157]:
print(f"sum of Max Speed col: {my_df['Max Speed'].sum()}")
print(f"mean of Max Speed col: {my_df['Max Speed'].mean()}")
print(f"min from Max Speed col: {my_df['Max Speed'].min()}")
print(f"max from Max Speed col: {my_df['Max Speed'].max()}")

sum of Max Speed col: 1050.0
mean of Max Speed col: 150.0
min from Max Speed col: 24.0
max from Max Speed col: 380.0

In [158]:
myDF.groupby(by='Type').mean()

         Max Speed
Type
Cat      83.333333
Falcon  375.000000
Parrot   25.000000

In [163]:
#More Practical Part

In [164]:
pokemonDF = pd.read_csv('Pokemon.csv')

In [165]:
print(pokemonDF)

       #                   Name   Type 1  Type 2  Total  HP  Attack  Defense  \
0      1              Bulbasaur    Grass  Poison    318  45      49       49
1      2                Ivysaur    Grass  Poison    405  60      62       63
2      3               Venusaur    Grass  Poison    525  80      82       83
3      3  VenusaurMega Venusaur    Grass  Poison    625  80     100      123
4      4             Charmander     Fire     NaN    309  39      52       43
..   ...                    ...      ...     ...    ...  ..     ...      ...
795  719                Diancie     Rock   Fairy    600  50     100      150
796  719    DiancieMega Diancie     Rock   Fairy    700  50     160      110
797  720    HoopaHoopa Confined  Psychic   Ghost    600  80     110       60
798  720     HoopaHoopa Unbound  Psychic    Dark    680  80     160       60
799  721              Volcanion     Fire   Water    600  80     110      120

     Sp. Atk  Sp. Def  Speed  Generation  Legendary
0         65       65     45           1      False
1         80       80     60           1      False
2        100      100     80           1      False
3        122      120     80           1      False
4         60       50     65           1      False
..       ...      ...    ...         ...        ...
795      100      150     50           6       True
796      160      110    110           6       True
797      150      130     70           6       True
798      170      130     80           6       True
799      130       90     70           6       True

[800 rows x 13 columns]

In [166]:
pokemonDF.head()

,#,Name,Type 1,Type 2,Total,HP,Attack,Defense,Sp. Atk,Sp. Def,Speed,Generation,Legendary
0,1,Bulbasaur,Grass,Poison,318,45,49,49,65,65,45,1,False
1,2,Ivysaur,Grass,Poison,405,60,62,63,80,80,60,1,False
2,3,Venusaur,Grass,Poison,525,80,82,83,100,100,80,1,False
3,3,VenusaurMega Venusaur,Grass,Poison,625,80,100,123,122,120,80,1,False
4,4,Charmander,Fire,NaN,309,39,52,43,60,50,65,1,False

In [167]:
pokemonDF.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 800 entries, 0 to 799
Data columns (total 13 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   #           800 non-null    int64
 1   Name        800 non-null    object
 2   Type 1      800 non-null    object
 3   Type 2      414 non-null    object
 4   Total       800 non-null    int64
 5   HP          800 non-null    int64
 6   Attack      800 non-null    int64
 7   Defense     800 non-null    int64
 8   Sp. Atk     800 non-null    int64
 9   Sp. Def     800 non-null    int64
 10  Speed       800 non-null    int64
 11  Generation  800 non-null    int64
 12  Legendary   800 non-null    bool
dtypes: bool(1), int64(9), object(3)
memory usage: 75.9+ KB

In [168]:
pokemonDF['Type 2'].fillna(pokemonDF['Type 1'], inplace=True)

/var/folders/r3/pdzzngtx1nzc5n6m5_5nm9540000gn/T/ipykernel_58650/1334498340.py:1: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  pokemonDF['Type 2'].fillna(pokemonDF['Type 1'], inplace=True)

In [169]:
print(pokemonDF)

       #                   Name   Type 1  Type 2  Total  HP  Attack  Defense  \
0      1              Bulbasaur    Grass  Poison    318  45      49       49
1      2                Ivysaur    Grass  Poison    405  60      62       63
2      3               Venusaur    Grass  Poison    525  80      82       83
3      3  VenusaurMega Venusaur    Grass  Poison    625  80     100      123
4      4             Charmander     Fire    Fire    309  39      52       43
..   ...                    ...      ...     ...    ...  ..     ...      ...
795  719                Diancie     Rock   Fairy    600  50     100      150
796  719    DiancieMega Diancie     Rock   Fairy    700  50     160      110
797  720    HoopaHoopa Confined  Psychic   Ghost    600  80     110       60
798  720     HoopaHoopa Unbound  Psychic    Dark    680  80     160       60
799  721              Volcanion     Fire   Water    600  80     110      120

     Sp. Atk  Sp. Def  Speed  Generation  Legendary
0         65       65     45           1      False
1         80       80     60           1      False
2        100      100     80           1      False
3        122      120     80           1      False
4         60       50     65           1      False
..       ...      ...    ...         ...        ...
795      100      150     50           6       True
796      160      110    110           6       True
797      150      130     70           6       True
798      170      130     80           6       True
799      130       90     70           6       True

[800 rows x 13 columns]

In [170]:
pokemonDF.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 800 entries, 0 to 799
Data columns (total 13 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   #           800 non-null    int64
 1   Name        800 non-null    object
 2   Type 1      800 non-null    object
 3   Type 2      800 non-null    object
 4   Total       800 non-null    int64
 5   HP          800 non-null    int64
 6   Attack      800 non-null    int64
 7   Defense     800 non-null    int64
 8   Sp. Atk     800 non-null    int64
 9   Sp. Def     800 non-null    int64
 10  Speed       800 non-null    int64
 11  Generation  800 non-null    int64
 12  Legendary   800 non-null    bool
dtypes: bool(1), int64(9), object(3)
memory usage: 75.9+ KB

In [171]:
pokemonDF[pokemonDF['Legendary']== True]

,#,Name,Type 1,Type 2,Total,HP,Attack,Defense,Sp. Atk,Sp. Def,Speed,Generation,Legendary
156,144,Articuno,Ice,Flying,580,90,85,100,95,125,85,1,True
157,145,Zapdos,Electric,Flying,580,90,90,85,125,90,100,1,True
158,146,Moltres,Fire,Flying,580,90,100,90,125,85,90,1,True
162,150,Mewtwo,Psychic,Psychic,680,106,110,90,154,90,130,1,True
163,150,MewtwoMega Mewtwo X,Psychic,Fighting,780,106,190,100,154,100,130,1,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...
795,719,Diancie,Rock,Fairy,600,50,100,150,100,150,50,6,True
796,719,DiancieMega Diancie,Rock,Fairy,700,50,160,110,160,110,110,6,True
797,720,HoopaHoopa Confined,Psychic,Ghost,600,80,110,60,150,130,70,6,True
798,720,HoopaHoopa Unbound,Psychic,Dark,680,80,160,60,170,130,80,6,True
799,721,Volcanion,Fire,Water,600,80,110,120,130,90,70,6,True

In [172]:
pokemonDF[pokemonDF['Legendary']== True].shape

(65, 13)

In [173]:
pokemonDF[pokemonDF['Name']== 'Volcanion'].shape

(1, 13)

In [174]:
pokemonDF.iloc[pokemonDF['Sp. Atk']].idxmax()

#             194
Name           46
Type 1         65
Type 2         65
Total         154
HP             45
Attack        154
Defense        87
Sp. Atk        71
Sp. Def        79
Speed         154
Generation    175
Legendary      65
dtype: int64

In [178]:
pokemonDF.sort_values(by="Attack", ascending=True).head(10)

,#,Name,Type 1,Type 2,Total,HP,Attack,Defense,Sp. Atk,Sp. Def,Speed,Generation,Legendary
488,440,Happiny,Normal,Normal,220,100,5,5,15,65,30,4,False
121,113,Chansey,Normal,Normal,450,250,5,5,35,105,50,1,False
230,213,Shuckle,Bug,Rock,505,20,10,230,10,230,5,2,False
261,242,Blissey,Normal,Normal,540,255,10,10,75,135,55,2,False
139,129,Magikarp,Water,Water,200,20,10,55,15,20,80,1,False
381,349,Feebas,Water,Water,200,20,15,20,10,55,80,3,False
68,63,Abra,Psychic,Psychic,310,25,20,15,105,55,90,1,False
508,458,Mantyke,Water,Flying,345,45,20,50,60,120,50,4,False
179,165,Ledyba,Bug,Flying,265,40,20,30,40,80,55,2,False
189,175,Togepi,Fairy,Fairy,245,35,20,65,40,65,20,2,False

In [180]:
pokemonDF['Name'].value_counts()

Name
Bulbasaur              1
Uxie                   1
GalladeMega Gallade    1
Probopass              1
Dusknoir               1
                      ..
Lugia                  1
Ho-oh                  1
Celebi                 1
Treecko                1
Volcanion              1
Name: count, Length: 800, dtype: int64

In [181]:
pokemonDF['Type 2'].value_counts()

Type 2
Flying      99
Water       73
Psychic     71
Normal      65
Grass       58
Poison      49
Ground      48
Fighting    46
Fire        40
Fairy       38
Electric    33
Dark        30
Dragon      29
Steel       27
Ice         27
Ghost       24
Rock        23
Bug         20
Name: count, dtype: int64

In [191]:
pokemonDF.groupby(by='Type 1')['HP'].mean()

Type 1
Bug         56.884058
Dark        66.806452
Dragon      83.312500
Electric    59.795455
Fairy       74.117647
Fighting    69.851852
Fire        69.903846
Flying      70.750000
Ghost       64.437500
Grass       67.271429
Ground      73.781250
Ice         72.000000
Normal      77.275510
Poison      67.250000
Psychic     70.631579
Rock        65.363636
Steel       65.222222
Water       72.062500
Name: HP, dtype: float64